#include "stdio.h"
#include "math.h"
void main()
{
	float r1 = 0.0414,r2 = 0.0468,r3 = 0.054,r4 = 0.0585,r5 = 0.0072;
	printf("一次存5年期,本息和为%.2f\n",1000 * (1 + 5 * r4));         //输出一次存5年期,本息和
	printf("先存两年期,到期后再存3年期,本息和为%.2f\n",(1000 * (1 + 2 * r2)) * (1 + 3 * r3));//输出先存两年期,到期后再存3年期,本息和
	printf("先存三年期,到期后再存两年期,本息和为%.2f\n",(1000 * (1 + 3 * r3)) * (1 + 2 * r2));//输出先存三年期,到期后再存两年期,本息和
	printf("存一年期，到期再存一年期，连续五次，本息和为%.2f\n",1000 * pow(1 + r1,5));//输出存一年期，到期再存一年期，连续五次，本息和
	printf("存活期，每季度结算一次，本息和为%.2f\n",1000 * pow(1 + r5/4,4 * 5));//输出存活期，每季度结算一次，本息和
}
